//1. 
//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果 
//A选手说：B第二，我第三； 
//B选手说：我第二，E第四； 
//C选手说：我第一，D第二； 
//D选手说：C最后，我第三； 
//E选手说：我第四，A第一； 
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。 
#include<stdio.h>
int main()
{
	int a=0,b=0,c=0,d=0,e=0;
	for(a=1; a<6; a++)
	{
		for(b=1; b<6; b++)
        		{
				for(c=1; c<6; c++)
        				{
						for(d=1; d<6; d++)
        						{
								for(e=1; e<6; e++)
        								{
										if((a!=b)&&(a!=c)&&(a!=d)&&(a!=e)&&(b!=d)&&(b!=e)&&(b!=c)&&(c!=d)&&(c!=e)&&(d!=e))
											{
												if(((b==2&&a!=3)||(b!=2&&a==3))&&((b==2&&e!=4)||(b!=2&&e==4))&&
												((c==1&&d!=2)||(c!=1&&d==2))&&((c==5&&d!=3)||(c!=5&&d==3))&&
												((e==4&&a!=1)||(e!=4&&a==1)))
													{
														printf("abcde的名次为：%d %d %d %d %d\n",a,b,c,d,e);
													}
											}
        								}
        						}
        				}
        		}	
	}
	return 0;
}
